# [Merges & Joins] Daten einfach verkn端pfen 端ber concat

In [3]:
import pandas as pd

## Series verkn端pfen

In [5]:
series1 = pd.Series(["merkur", "neptun", "mars"])
series2 = pd.Series(["venus", "uranus", "pluto"])

In [7]:
series3 = pd.concat([series1, series2])

In [8]:
series3

0    merkur
1    neptun
2      mars
0     venus
1    uranus
2     pluto
dtype: object

In [10]:
pd.concat([series1, series2], keys=["series1", "series2"], names=["Gruppe 1", "Gruppe 2"])

Gruppe 1  Gruppe 2
series1   0           merkur
          1           neptun
          2             mars
series2   0            venus
          1           uranus
          2            pluto
dtype: object

## DataFrames verkn端pfen

In [12]:
planeten1 = pd.DataFrame(data=[["merkur", 222], ["neptun", 4676], ["mars", 401]], 
                        columns = ["Planet", "Entfernung zur Erde in Mio. km"])

planeten2 = pd.DataFrame(data=[["venus", 261], ["uranus", 3157], ["pluto", 7528]], 
                        columns = ["Planet", "Entfernung zur Erde in Mio. km"])

In [14]:
print(planeten1)
print(planeten2)

   Planet  Entfernung zur Erde in Mio. km
0  merkur                             222
1  neptun                            4676
2    mars                             401
   Planet  Entfernung zur Erde in Mio. km
0   venus                             261
1  uranus                            3157
2   pluto                            7528

In [15]:
pd.concat([planeten1, planeten2])

   Planet  Entfernung zur Erde in Mio. km
0  merkur                             222
1  neptun                            4676
2    mars                             401
0   venus                             261
1  uranus                            3157
2   pluto                            7528

In [16]:
pd.concat([planeten1, planeten2], join="inner")

   Planet  Entfernung zur Erde in Mio. km
0  merkur                             222
1  neptun                            4676
2    mars                             401
0   venus                             261
1  uranus                            3157
2   pluto                            7528